Revit 2026 API

# MechanicalUtils Class

---

General utility methods in the Autodesk Revit MEP product.

SystemObject Autodesk.Revit.DB.MechanicalMechanicalUtils

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class MechanicalUtils
```
```vb
Public NotInheritable Class MechanicalUtils
```
```cpp
public ref class MechanicalUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type MechanicalUtils = class end
```

The MechanicalUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BreakCurve | Breaks the duct curve into two parts at the given position. |
|  | ConnectAirTerminalOnDuct | Connects an air terminal to a duct directly (without the need for a tee or takeoff). |
|  | ConnectDuctPlaceholdersAtCross(Document, ElementId, ElementId) | Connects a pair of placeholders that can intersect in a Cross connection. |
|  | ConnectDuctPlaceholdersAtCross(Document, ElementId, ElementId, ElementId) | Connects a trio of placeholders that can intersect in a Cross connection. |
|  | ConnectDuctPlaceholdersAtCross(Document, Connector, Connector, Connector, Connector) | Connects a group of placeholders that can intersect in a Cross connection. |
|  | ConnectDuctPlaceholdersAtElbow(Document, Connector, Connector) | Connects a pair of placeholders that can intersect in an Elbow connection. |
|  | ConnectDuctPlaceholdersAtElbow(Document, ElementId, ElementId) | Connects a pair of placeholders that can intersect in an Elbow connection. |
|  | ConnectDuctPlaceholdersAtTee(Document, ElementId, ElementId) | Connects a pair of placeholders that can intersect in a Tee connection. |
|  | ConnectDuctPlaceholdersAtTee(Document, Connector, Connector, Connector) | Connects a trio of placeholders that can intersect in a Tee connection. |
|  | ConvertDuctPlaceholders |  |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace